In [1]:
#Checking for hypothesis 4 - 
# is there a higher proportion of male unemployment (aged 16 and over) 
# in London compared to the rest of UK?

# where unemployment = people out of work, who are actively looking for work and 
# are available to start immediately.

# 1. We have quarterly data from 2009 to 2019 for unemployed males and females
# in London and the rest of UK.

# 2. Using this data, we will check the level of male unemployment
# in four quarters of a particular year(2016) relative to quarters of 
# previous years (2011-'15). The date shown is the month the quarter ends on. 

# 3.H0 = There is no change in male unemployment levels between 2011-'15 and
# 2016
#  H1 = Male Unemployment has increased / decreased between 2011-'15 and 2016


# Importing necessary directories

import pandas as pd
import numpy as np
import requests
import json

In [8]:
#Importing the .xls file selecting the sheet with gender-related data

gender_data = pd.read_excel('unemployment-equalities-group.xls', sheet_name='Sex')

In [9]:
gender_data.head()

,By Sex,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,16+ unemployment rate,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Male,NaN,NaN,NaN,Female,NaN,NaN,NaN
2,NaN,London,NaN,United Kingdom,NaN,London,NaN,United Kingdom,NaN
3,12 months ending,Number,Rate,Number,Rate,Number,Rate,Number,Rate
4,2009-03-01 00:00:00,164900,7.3,1126300,6.7,139000,7.6,797200,5.5

In [117]:
#Simplifying the nomenclature of columns 

#dropping female data 

df.rename({'By Sex' : 'Date', 
           'Unnamed: 1' : 'No. of unemployed in London',
           'Unnamed: 2' : 'Rate of unemployment in London',
           'Unnamed: 3' : 'No. of unemployed in UK', 
           'Unnamed: 4' : 'Rate of unemployment in UK'}, axis = 1, inplace = True)

df.iloc[:, [0,1,2,3,4]].head()

,Date,No. of unemployed in London,Rate of unemployment in London,No. of unemployed in UK,Rate of unemployment in UK
4,2009-03-01 00:00:00,164900,7.3,1126300,6.7
5,2009-06-01 00:00:00,182100,8.1,1261800,7.5
6,2009-09-01 00:00:00,186100,8.2,1377900,8.2
7,2009-12-01 00:00:00,204700,9,1441600,8.5
8,2010-03-01 00:00:00,210100,9.2,1490300,8.8

In [118]:
#Checking statistics 

df['No. of unemployed in London'].mean()

189580.0

In [119]:
df['No. of unemployed in UK'].mean()

1339580.0

In [120]:
df['No. of unemployed in London'].median()

186100.0

In [121]:
df['No. of unemployed in UK'].median()

1377900.0

In [122]:
df['Rate of unemployment in London'].median()

8.2

In [123]:
df['Rate of unemployment in UK'].mean()

7.94

In [127]:
df['No. of unemployed in London'].std()

18212.962416916147

In [132]:
crime_df = pd.read_csv('/Users/mahimakaushiva/Desktop/Mod3Project/London Crime Data 2011 to 2014/2010-12-metropolitan-street.csv')
crime_df.head()

,Crime ID,Month,Reported by,Falls within,Longitude,Latitude,Location,LSOA code,LSOA name,Crime type,Last outcome category,Context
0,NaN,2010-12,Metropolitan Police Service,Metropolitan Police Service,0.145949,51.593914,On or near Providence Place,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN
1,NaN,2010-12,Metropolitan Police Service,Metropolitan Police Service,0.140192,51.582311,On or near Hatch Grove,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN
2,NaN,2010-12,Metropolitan Police Service,Metropolitan Police Service,0.134947,51.588063,On or near Mead Grove,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN
3,NaN,2010-12,Metropolitan Police Service,Metropolitan Police Service,0.134947,51.588063,On or near Mead Grove,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN
4,NaN,2010-12,Metropolitan Police Service,Metropolitan Police Service,0.134947,51.588063,On or near Mead Grove,E01000027,Barking and Dagenham 001A,Anti-social behaviour,NaN,NaN

In [134]:
crime_df.isna().sum()

Crime ID                 92442
Month                        0
Reported by                  0
Falls within                 0
Longitude                    0
Latitude                     0
Location                     0
LSOA code                    0
LSOA name                    0
Crime type                   0
Last outcome category    92442
Context                  92442
dtype: int64

In [146]:
crime_df.drop(['Reported by', 'Falls within', 'Longitude', 
               'Latitude', 'Location', 'LSOA code'], axis = 1, inplace = True) # LSOA - lower layer super output area

In [150]:
crime_df.head()

     Month                  LSOA name             Crime type
0  2010-12  Barking and Dagenham 001A  Anti-social behaviour
1  2010-12  Barking and Dagenham 001A  Anti-social behaviour
2  2010-12  Barking and Dagenham 001A  Anti-social behaviour
3  2010-12  Barking and Dagenham 001A  Anti-social behaviour
4  2010-12  Barking and Dagenham 001A  Anti-social behaviour

In [151]:
crime_df.sort_values(by = ['Crime type', 'LSOA name'])

         Month                  LSOA name             Crime type
0      2010-12  Barking and Dagenham 001A  Anti-social behaviour
1      2010-12  Barking and Dagenham 001A  Anti-social behaviour
2      2010-12  Barking and Dagenham 001A  Anti-social behaviour
3      2010-12  Barking and Dagenham 001A  Anti-social behaviour
4      2010-12  Barking and Dagenham 001A  Anti-social behaviour
...        ...                        ...                    ...
92422  2010-12           Westminster 024C          Violent crime
92427  2010-12           Westminster 024D          Violent crime
92434  2010-12           Westminster 024F          Violent crime
92435  2010-12           Westminster 024F          Violent crime
92436  2010-12           Westminster 024F          Violent crime

[92442 rows x 3 columns]

In [165]:
for i in 'Crime type':
    if i is 'Violent crime':
        print(i)
    else:
        print ('stop')

stop
stop
stop
stop
stop
stop
stop
stop
stop
stop